InformationRegisters/ВерсииПодсистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ВерсииПодсистем</Name>
			<Comment>Версии этой конфигурации и родительских конфигураций на поддержке</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПланОбновления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОсновнаяКонфигурация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполненаРегистрацияОтложенныхОбработчиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяПодсистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВерсииПодсистем/Ext/ManagerModule.bsl
#Область Интерфейс

Функция ВерсияУЗ() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВерсииПодсистем.Версия
	|ИЗ
	|	РегистрСведений.ВерсииПодсистем КАК ВерсииПодсистем
	|ГДЕ
	|	ВерсииПодсистем.ИмяПодсистемы = &ИмяПодсистемы";
	
	Запрос.УстановитьПараметр("ИмяПодсистемы", ИмяПодсистемы());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
	
		Возврат Результат.Версия;
	
	КонецЕсли;
	
	Возврат "";

КонецФункции // ()

Функция ОбновитьВерсиюУЗ(НомерВерсии) Экспорт

	Запись = СоздатьМенеджерЗаписи();
	Запись.Версия = НомерВерсии;
	Запись.ИмяПодсистемы = ИмяПодсистемы();
	Запись.ВыполненаРегистрацияОтложенныхОбработчиков = Истина;
	Запись.ЭтоОсновнаяКонфигурация = Истина;
	
	Запись.Записать(Истина);

КонецФункции // ()

#КонецОбласти

#Область Техническая

Функция ИмяПодсистемы()

	Возврат Метаданные.Имя;

КонецФункции // ()

#КонецОбласти
